ewowi/projectMM-v3/src/platform/esp32/platform_esp32_rmt.cpp
// RMT WS2812 LED output: the peripheral half of the LED driver.
//
// The driver (src/light/drivers/RmtLedDriver.h) does all the domain work: it applies Correction and
// hands us the WIRE BYTES, the finished per-channel values the strip expects. This file owns only
// the peripheral: channel setup, the bit expansion, transmit + wait, and the RX side the on-device
// loopback test uses. No domain logic here.
//
// Wire-byte path: each byte becomes eight symbols on the way to the peripheral, MSB-first, using
// the two bit shapes rmtWs2812SetBitTiming programs (makeRmtSymbol in RmtSymbol.h packs that 32-bit
// format). The IDF bytes encoder does it where RMT has DMA; the classic ESP32's level-5 refill does
// it inline in rmtHiFill. So the caller keeps 3-4 bytes per light rather than 32 bytes per byte of
// it: a long strand no longer outgrows the internal RAM the refill is restricted to.

#include "platform/platform.h"

#include "driver/rmt_tx.h"
#include "driver/rmt_rx.h"
#include "driver/rmt_encoder.h"
#include "driver/gpio.h"   // continuity pre-check in the loopback self-test
#include "soc/soc_caps.h"  // SOC_RMT_MEM_WORDS_PER_CHANNEL (64 classic, 48 S3)
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/task.h"
#include "rom/ets_sys.h"   // ets_delay_us for the reset gap

#include "esp_heap_caps.h"   // capture buffer alloc for the shared frame loopback
#include "esp_timer.h"       // timed first transmit
#include "esp_log.h"
#include "esp_cpu.h"
#if CONFIG_IDF_TARGET_ESP32
// The level-5 refill path (rmt_hi_vector.S): the classic ESP32 has no RMT DMA, so the refill
// interrupt is the whole timing story. These are the pieces that path drives directly.
#include "esp_rom_sys.h"          // esp_rom_route_intr_matrix
#include "esp_memory_utils.h"     // esp_ptr_internal: the ISR may only read internal RAM
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"        // vTaskDelay in the polled wait
#include "hal/rmt_ll.h"
#include "soc/rmt_struct.h"       // RMT
#include "soc/gpio_struct.h"      // GPIO.func_out_sel_cfg: which channel a pin got
#include "soc/gpio_sig_map.h"     // RMT_SIG_OUT0_IDX
#include "soc/interrupts.h"       // ETS_RMT_INTR_SOURCE
#include "soc/dport_reg.h"        // the interrupt matrix map registers, read back after routing
#endif

#include <cstdlib>
#include <cstring>
#include <functional>  // the transmit callback the shared frame loopback takes
#include <new>      // std::nothrow

#if CONFIG_IDF_TARGET_ESP32
// ---------------------------------------------------------------------------------------------
// Level-5 refill. The IDF driver keeps everything about the channel (GPIO, clock, memory blocks,
// power) and is bypassed for the transmit itself: its interrupt runs at level 1-3, which every
// critical section masks, and that is what let a refill arrive late (see rmt_hi_vector.S). The
// RMT interrupt source on core 1 is rerouted to vector 26 (level 5, refused by esp_intr_alloc as
// "special", so routed by hand), and this code plays each frame ping-pong out of the channel's
// memory, one half-block per threshold interrupt, straight from the driver's frame buffer.
//
// At file scope, outside every namespace: the assembly bridge calls rmtHiIsr by its C name, and
// RMTMEM is the linker's symbol, so both need external C linkage, which an anonymous namespace
// would silently take away.
//
// Everything the ISR touches lives in internal RAM: the channel state (DRAM), the symbol buffer
// (the driver allocates it internal-first and the transmit refuses anything else), RMT registers
// and RMTMEM (peripheral). So it also runs through a flash-cache-off window, which a flash write
// opens on both cores.
// ---------------------------------------------------------------------------------------------
struct RmtHiChannel {
    const uint8_t* cur = nullptr;    // next WIRE BYTE to expand
    const uint8_t* end = nullptr;    // one past the last
    uint32_t sym0 = 0;               // the symbol a 0 bit expands to
    uint32_t sym1 = 0;               // ... and a 1 bit
    uint16_t half = 0;               // symbols per half-block (the threshold)
    uint16_t offset = 0;             // where the next half goes: 0 or `half`
    volatile bool busy = false;      // a frame is on the wire
};
static RmtHiChannel s_hi[RMT_LL_CHANS_PER_INST];

// RMTMEM is a linker-provided address; the IDF types it in a private header, so the same layout
// is declared here: 8 channels of 64 words, contiguous, which is what lets a channel that owns
// several blocks be addressed as one run past its own 64.
struct RmtHiMem { struct { volatile uint32_t data32[SOC_RMT_MEM_WORDS_PER_CHANNEL]; } chan[RMT_LL_CHANS_PER_INST]; };
extern "C" RmtHiMem RMTMEM;
extern "C" void ld_include_rmt_hi_vector();   // forces the .S object to link (the vector symbol is weak elsewhere)

// Copy the next half-block for `ch`. Runs at level 5: no RTOS, no logging, no cache-dependent
// memory. A frame shorter than the remaining half ends with a zero symbol, which the peripheral
// treats as end-of-transmission and raises TX_DONE on.
static void IRAM_ATTR rmtHiFill(uint8_t ch) {
    RmtHiChannel& c = s_hi[ch];
    volatile uint32_t* dst = &RMTMEM.chan[ch].data32[c.offset];
    uint32_t n = c.half;
    // Expand WIRE BYTES to symbols here, MSB-first, rather than copying symbols a caller
    // pre-expanded. Eight symbols per byte, so the resident buffer is the 3-4 bytes per light the
    // correction already produces instead of 8 words (32 bytes) per byte of it: 3 KB for 1024
    // lights where the pre-expanded form wanted 96 KB. That buffer has to be internal RAM (this
    // runs with the flash cache possibly off), and 96 KB of internal RAM is what a classic ESP32
    // does not have, so above ~800 lights the pre-expanded form fell back to PSRAM and the
    // transmit refused every frame: issue #94's frozen strip. The work per half-block is a shift
    // and a select per bit, well inside the ~40 us deadline.
    const uint32_t s0 = c.sym0, s1 = c.sym1;
    while (n >= 8 && c.cur != c.end) {
        uint8_t data = *c.cur++;
        for (uint8_t bit = 0; bit < 8; bit++) { *dst++ = (data & 0x80u) ? s1 : s0; data = static_cast<uint8_t>(data << 1); }
        n -= 8;
    }
    if (n) *dst = 0;                                   // end marker inside this half
    c.offset = static_cast<uint16_t>(c.offset ? 0 : c.half);
}

