ewowi/projectMM-v3/src/platform/esp32/platform_esp32_rmt.cpp
// The C half of the level-5 handler. Called from rmt_hi_vector.S with the register file saved
// and a private stack; must return promptly and must clear what it handles, the interrupt is
// level-triggered.
extern "C" void IRAM_ATTR rmtHiIsr(void*) {
    const uint32_t st = RMT.int_st.val;
    for (uint8_t ch = 0; ch < RMT_LL_CHANS_PER_INST; ch++) {
        const uint32_t thres = RMT_LL_EVENT_TX_THRES(ch), done = RMT_LL_EVENT_TX_DONE(ch);
        if (st & thres) {
            rmt_ll_clear_interrupt_status(&RMT, thres);
            if (s_hi[ch].busy) rmtHiFill(ch);
        }
        if (st & done) {
            rmt_ll_clear_interrupt_status(&RMT, done);
            s_hi[ch].busy = false;
            rmt_ll_enable_interrupt(&RMT, thres | done, false);
        }
    }
}

// Which peripheral channel the IDF handed this GPIO: the matrix records the output signal, and
// the RMT signals are consecutive from RMT_SIG_OUT0_IDX. The driver keeps the id private.
static uint8_t rmtHiChannelOf(uint8_t gpio) {
    const uint32_t sig = GPIO.func_out_sel_cfg[gpio].func_sel;
    return (sig >= RMT_SIG_OUT0_IDX && sig < RMT_SIG_OUT0_IDX + RMT_LL_CHANS_PER_INST)
           ? static_cast<uint8_t>(sig - RMT_SIG_OUT0_IDX) : 0xFF;
}

// Route the RMT interrupt source on THIS core to vector 26 and enable it. Runs on core 1 (inside
// the init hop) because INTENABLE is per core. After this the IDF driver's own level-1 handler
// on this core never fires again, which is intended: nothing here calls rmt_transmit any more,
// so nothing waits on it.
//
// Called after EVERY channel creation, not once: rmt_new_tx_channel routes the source back to the
// driver's own vector each time (intr_alloc.c), and a config change re-creates the channel. A
// once-only guard here let the second init hand the threshold events to the driver's handler,
// which has no transaction and dereferences null: a boot loop ~10 s in, when the network coming
// up triggered the second prepare sweep. Bench-found on the second Dig-Next-2.
static void rmtHiRouteOnThisCore() {
#if defined(CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_5) || defined(CONFIG_BTDM_CTRL_HLI)
#error "level 5 is taken on this config (system check or Bluetooth HLI); the RMT refill needs it free"
#endif
    (void)&ld_include_rmt_hi_vector;
    constexpr uint32_t kVector = 26;   // level 5, "special" in the descriptor table, free here
    esp_rom_route_intr_matrix(esp_cpu_get_core_id(), ETS_RMT_INTR_SOURCE, kVector);
    esp_cpu_intr_enable(1u << kVector);
    // Read the routing back: the matrix map for this core's RMT source, and this core's
    // INTENABLE. The IDF's esp_intr_enable re-programs the map (intr_alloc.c), so a later call on
    // the driver's own handle would silently undo this; the readback is what proves it held.
    const uint32_t mapReg = esp_cpu_get_core_id() == 0
        ? DPORT_PRO_RMT_INTR_MAP_REG : DPORT_APP_RMT_INTR_MAP_REG;
    ESP_LOGI("rmt", "level-5 refill: RMT source routed to vector %lu on core %d; map reads %lu, INTENABLE 0x%08lx",
             static_cast<unsigned long>(kVector), static_cast<int>(esp_cpu_get_core_id()),
             static_cast<unsigned long>(DPORT_REG_READ(mapReg)),
             static_cast<unsigned long>(esp_cpu_intr_get_enabled_mask()));
}
#endif  // CONFIG_IDF_TARGET_ESP32

namespace mm::platform {

namespace {

// Per-channel peripheral state, hidden behind RmtWs2812Handle::impl so the
// domain header never sees an ESP type. One TX channel + the copy encoder it
// streams symbols through, both allocated once at init.
struct RmtTxState {
    rmt_channel_handle_t channel = nullptr;
    rmt_encoder_handle_t encoder = nullptr;
    uint32_t resolutionHz = 0;
    uint32_t sym0 = 0, sym1 = 0;  // bit shapes, set live by rmtWs2812SetBitTiming (every chip:
                                  // the bytes encoder takes them, and so does the level-5 refill)
#if CONFIG_IDF_TARGET_ESP32
    uint8_t  channelId = 0xFF;    // the peripheral channel the IDF gave us, read back from the GPIO matrix
    uint16_t blockSymbols = 0;    // symbols the channel's memory holds (64 per block)
#endif
};


} // namespace

// The channel is created on CORE 1, and that is the whole point of the detour below.
//
// An RMT TX channel's refill interrupt is bound to whichever core calls rmt_new_tx_channel
// (esp_intr_alloc pins to the calling core; esp_intr_alloc_info_t has no core field). Init is
// reached from the prepare sweep on the main task, and CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0 puts
// that on core 0, where the WiFi task is also pinned. So the driver TICKED on core 1 while its
// interrupt lived with WiFi on core 0, and every WiFi burst that ran above the RMT's level-3
// ceiling delayed a refill past the 64-symbol deadline: a DMA-less chip keeps clocking the
// stale block and the strip shows a few wrong lights, at any light count, at any TX power.
// Bench (QuinLED Dig-Next-2, 256 WS2812): more memory blocks softened it, priority 3 did
// nothing (WiFi's ISR is above 3 on the same core), halving the lights changed nothing.
// Espressif's RMT maintainer names this exact fix on esp-idf#5173: create the channel on the
// core WiFi is not on. Core 1 here carries only the encode task, so the refill runs undisturbed.
//
// A pinned one-shot task, not esp_ipc_call_blocking: the IPC task has a 1 KB stack and channel
// creation allocates and installs an interrupt. Deinit needs no counterpart: esp_intr_free hops
// to the allocating core itself (intr_alloc.c, via IPC). Chips with RMT DMA gain nothing from
// the hop but lose nothing either, so it is unconditional.
namespace {
struct RmtInitJob {
    RmtTxState* st;
    uint8_t gpio;
    uint32_t resolutionHz;
    bool invert;
    bool ok;
};

void rmtInitOnThisCore(void* arg) {
    auto* job = static_cast<RmtInitJob*>(arg);
    RmtTxState* st = job->st;
    rmt_tx_channel_config_t txCfg = {};
    txCfg.gpio_num = static_cast<gpio_num_t>(job->gpio);
    txCfg.clk_src = RMT_CLK_SRC_DEFAULT;
    txCfg.resolution_hz = job->resolutionHz;
    txCfg.trans_queue_depth = 4;
    txCfg.flags.invert_out = job->invert ? 1 : 0;
    // One memory block per channel, the chip's own size (64 words classic, 48 on the S3: a
    // hardcoded 64 makes rmt_new_tx_channel reject the S3), so all eight RMT channels stay
    // available to an eight-pin board. On the classic ESP32 the block is the refill deadline
    // (~40 us per half-block), and with the refill at interrupt level 1 that deadline was missed
    // under WiFi: four blocks softened it, eight made it worse. With the refill at level 5
    // (below) one block is flicker-free, bench-verified on two Dig-Next-2 boards, so the extra
    // blocks bought nothing but lost pins.
    txCfg.mem_block_symbols = SOC_RMT_MEM_WORDS_PER_CHANNEL;
    if (rmt_new_tx_channel(&txCfg, &st->channel) != ESP_OK) { job->ok = false; return; }

    // A BYTES encoder, the IDF's own WS2812-shaped one: it expands each wire byte to eight symbols
    // as it feeds the peripheral, so the caller keeps only the 3-4 bytes per light the correction
    // produces. The copy encoder this replaces required the caller to pre-expand every bit into a
    // 32-bit symbol first, 96 bytes per RGB light, which is the buffer that outgrew internal RAM.
    // The bit timings are placeholders: the driver's `timing` control is live, so
    // rmtWs2812SetBitTiming rewrites them (rmt_bytes_encoder_update_config) before each frame.
    rmt_bytes_encoder_config_t bytesCfg = {};
    bytesCfg.flags.msb_first = 1;          // WS2812 clocks the most significant bit first
    if (rmt_new_bytes_encoder(&bytesCfg, &st->encoder) != ESP_OK) {
        rmt_del_channel(st->channel); st->channel = nullptr;
        job->ok = false; return;
    }
    if (rmt_enable(st->channel) != ESP_OK) {
        rmt_del_encoder(st->encoder); st->encoder = nullptr;
        rmt_del_channel(st->channel); st->channel = nullptr;
        job->ok = false; return;
    }
    ESP_LOGI("rmt", "channel on GPIO %u created on core %d (%lu-symbol block)",
             static_cast<unsigned>(job->gpio), static_cast<int>(esp_cpu_get_core_id()),
             static_cast<unsigned long>(txCfg.mem_block_symbols));
#if CONFIG_IDF_TARGET_ESP32
    st->channelId = rmtHiChannelOf(job->gpio);
    st->blockSymbols = static_cast<uint16_t>(txCfg.mem_block_symbols);
    if (st->channelId != 0xFF) {
        rmt_ll_tx_enable_wrap(&RMT, st->channelId, true);      // one global bit on this chip
        rmt_ll_tx_set_limit(&RMT, st->channelId, st->blockSymbols / 2);
        rmtHiRouteOnThisCore();
        ESP_LOGI("rmt", "level-5 refill on channel %u, %u-symbol halves",
                 static_cast<unsigned>(st->channelId), static_cast<unsigned>(st->blockSymbols / 2));
    } else {
        ESP_LOGW("rmt", "could not read the channel back from the GPIO matrix; IDF transmit path");
    }
#endif
    job->ok = true;
}
}  // namespace

bool rmtWs2812Init(RmtWs2812Handle& h, uint8_t gpio, uint32_t resolutionHz, bool invert) {
    auto* st = new (std::nothrow) RmtTxState();
    if (!st) return false;

    RmtInitJob job{st, gpio, resolutionHz, invert, false};
    WorkerTask hop;
    // Priority above the render loop so the one-shot runs at once; 8 KB matches the encode
    // task. If the spawn fails (single core, no memory) the init runs inline on this core, which
    // is the pre-fix behavior rather than no channel at all.
    if (spawnPinnedTask(hop, "mmRmtInit", &rmtInitOnThisCore, &job, 8192, 6, 1)) {
        stopPinnedTask(hop);          // joins: the fn already returned, this only reaps the task
    } else {
        rmtInitOnThisCore(&job);
    }
    if (!job.ok) { delete st; return false; }

