ewowi/projectMM-v3/src/platform/esp32/platform_esp32_rmt.cpp
    st->resolutionHz = resolutionHz;
    h.impl = st;
    return true;
}

uint32_t rmtWs2812Resolution(const RmtWs2812Handle& h) MM_NONBLOCKING {
    auto* st = static_cast<RmtTxState*>(h.impl);
    return st ? st->resolutionHz : 0;
}

bool rmtWs2812SetBitTiming(RmtWs2812Handle& h, uint32_t sym0, uint32_t sym1) {
    auto* st = static_cast<RmtTxState*>(h.impl);
    if (!st || !st->encoder) return false;
    st->sym0 = sym0; st->sym1 = sym1;
    // The `timing` control is live (400 kHz WS2811, 800 kHz, custom ns), so the encoder's bit
    // shapes are rewritten rather than fixed at init.
    rmt_bytes_encoder_config_t cfg = {};
    static_assert(sizeof(rmt_symbol_word_t) == sizeof(uint32_t), "symbol word is one 32-bit word");
    std::memcpy(&cfg.bit0, &sym0, sizeof(uint32_t));
    std::memcpy(&cfg.bit1, &sym1, sizeof(uint32_t));
    cfg.flags.msb_first = 1;
    return rmt_bytes_encoder_update_config(st->encoder, &cfg) == ESP_OK;
}

bool rmtWs2812Transmit(RmtWs2812Handle& h, const uint8_t* wire, size_t byteCount) {
    auto* st = static_cast<RmtTxState*>(h.impl);
    if (!st || !wire || byteCount == 0) return false;

#if CONFIG_IDF_TARGET_ESP32
    if (st->channelId != 0xFF) {
        // The level-5 path expands the bytes itself (rmtHiFill). Those bytes must be internal RAM:
        // the refill runs with the flash cache possibly off, where a PSRAM read is a fault rather
        // than a stall. At 3-4 bytes per light that is a few KB even for a long strand, so unlike
        // the pre-expanded symbol form this does not outgrow internal RAM: issue #94.
        if (!esp_ptr_internal(wire)) return false;
        RmtHiChannel& c = s_hi[st->channelId];
        if (c.busy) return false;
        const uint8_t ch = st->channelId;
        c.cur = wire; c.end = wire + byteCount;
        c.sym0 = st->sym0; c.sym1 = st->sym1;
        // The expander consumes whole BYTES (8 symbols each), so a half-block that is not a
        // multiple of 8 would leave 1..7 symbols unfilled and end the frame early with no
        // diagnostic. True for every chip today; asserted so a mem_block_symbols change says so.
        static_assert(SOC_RMT_MEM_WORDS_PER_CHANNEL % 16 == 0,
                      "half-block must be a multiple of 8 symbols: rmtHiFill expands whole bytes");
        c.half = st->blockSymbols / 2; c.offset = 0;
        c.busy = true;
        rmt_ll_tx_reset_pointer(&RMT, ch);
        rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_TX_THRES(ch) | RMT_LL_EVENT_TX_DONE(ch));
        rmtHiFill(ch);                     // both halves primed before the start
        rmtHiFill(ch);
        rmt_ll_enable_interrupt(&RMT, RMT_LL_EVENT_TX_THRES(ch) | RMT_LL_EVENT_TX_DONE(ch), true);
        rmt_ll_tx_start(&RMT, ch);
        return true;
    }
#endif
    rmt_transmit_config_t txCfg = {};
    txCfg.loop_count = 0;   // single shot, no hardware loop

    // The bytes encoder expands each byte to eight symbols as it feeds the peripheral, so the wire
    // bytes go straight out. This only *starts* the transfer: channels started back-to-back clock
    // out concurrently, which is what makes a multi-pin frame cost the longest strand instead of
    // the sum. The caller pairs this with rmtWs2812Wait and owns the inter-frame latch.
    return rmt_transmit(st->channel, st->encoder, wire, byteCount, &txCfg) == ESP_OK;
}

bool rmtWs2812Wait(RmtWs2812Handle& h, uint32_t timeoutMs) {
    auto* st = static_cast<RmtTxState*>(h.impl);
    if (!st) return true;
    // Finite timeout so a wedged DMA can't hang the render tick forever. Even the
    // longest realistic frame (thousands of pixels) clocks out well under 1 s; a
    // timeout here means the peripheral is stuck, and the driver re-encodes the
    // whole frame next tick anyway, so a dropped frame self-heals.
    //
    // We deliberately do NOT cancel a timed-out transfer with rmt_disable(): on
    // classic ESP32, rmt_disable() while a transmission is still active triggers an
    // interrupt-WDT panic (espressif/esp-idf#17692, classic-only — S3/C6/P4 are
    // unaffected). A panic is a worse failure than a dropped frame, so we leave the
    // stuck transfer alone. It self-heals safely: the next tick re-encodes the frame buffer
    // and calls rmt_transmit again; if the channel is still busy, rmt_transmit
    // returns an error, rmtWs2812Transmit returns false, and RmtLedDriver::tick()
    // skips waiting on that channel (its started[] guard) — no crash, no corruption.
    // The RESULT is what the caller needs: a timeout leaves the frame in flight, and re-encoding
    // into the frame buffer next tick would rewrite bytes the peripheral is still clocking out. That is a
    // silent corruption rather than a dropped frame, and it shows on the strip as a few lights in
    // the wrong color, independent of light count.
#if CONFIG_IDF_TARGET_ESP32
    if (st->channelId != 0xFF) {
        // TX_DONE clears `busy` from the level-5 handler. Polled with a yield, not a semaphore:
        // the handler runs where no RTOS call is allowed, so it cannot signal one.
        const int64_t deadline = esp_timer_get_time() + static_cast<int64_t>(timeoutMs) * 1000;
        while (s_hi[st->channelId].busy) {
            if (esp_timer_get_time() > deadline) return false;
            vTaskDelay(1);
        }
        return true;
    }
#endif
    return rmt_tx_wait_all_done(st->channel, timeoutMs) == ESP_OK;
}

void rmtWs2812Deinit(RmtWs2812Handle& h) {
    auto* st = static_cast<RmtTxState*>(h.impl);
    if (!st) return;
#if CONFIG_IDF_TARGET_ESP32
    if (st->channelId != 0xFF) {
        rmt_ll_enable_interrupt(&RMT, RMT_LL_EVENT_TX_THRES(st->channelId) | RMT_LL_EVENT_TX_DONE(st->channelId), false);
        s_hi[st->channelId].busy = false;
    }
#endif
    if (st->channel) {
        rmt_disable(st->channel);
        rmt_del_channel(st->channel);
    }
    if (st->encoder) rmt_del_encoder(st->encoder);
    delete st;
    h.impl = nullptr;
}

// ---------------------------------------------------------------------------
// RX loopback capture — on-device test only. Opens a one-shot RX channel on the
// jumpered pin, captures raw pulse symbols, returns how many landed. The test
// decodes those symbols back to bytes and asserts == sent.
// ---------------------------------------------------------------------------

namespace {

// done-callback hands the received symbol count to the waiting capture call via
// a 1-deep queue. IRAM so it survives a cache-disabled window.
struct RxDone { size_t numSymbols; };

